In [1]:
import pandas as pd

In [2]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [7]:
obj3['California']

True

In [8]:
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [9]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [24]:
df_lis = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]], index=[4, 5, 6], columns=['a', 'b', 'c'])
df_lis

    a   b   c
4   0   2   3
5   0   4   1
6  10  20  30

In [14]:
df_lis.rename(mapper = lambda x: x.upper(), axis=1, inplace=True)

In [15]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [19]:
df_lis = df_lis.rename(mapper = lambda x: x.upper(), axis = 1)

In [20]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [22]:
df_lis = df_lis.rename(mapper = lambda x: x.upper(), axis = 'columns')

In [23]:
df_lis

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [25]:
df_lis.rename(mapper = lambda x: x.upper(), axis=1)

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [26]:
df_lis

    a   b   c
4   0   2   3
5   0   4   1
6  10  20  30

In [30]:
df_lis.where(df_lis['c']>1)

      a     b     c
4   0.0   2.0   3.0
5   NaN   NaN   NaN
6  10.0  20.0  30.0

In [33]:
df_lis.drop('a', axis=1)

    b   c
4   2   3
5   4   1
6  20  30

In [38]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [45]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [47]:
df = pd.DataFrame({'Serial No.': [1,2,3,4,5], 'gre score': [337,324,316,322,314], 'toefl score': [118,107,104,110,103]})
df = df.set_index('Serial No.')
df

            gre score  toefl score
Serial No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [49]:
(df['toefl score']>105) & (df['toefl score']<115)

Serial No.
1    False
2     True
3    False
4     True
5    False
Name: toefl score, dtype: bool

In [50]:
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]

            gre score  toefl score
Serial No.
2                 324          107
4                 322          110

In [51]:
df[(df['toefl score']>105) & (df['toefl score']<115)]

            gre score  toefl score
Serial No.
2                 324          107
4                 322          110

In [53]:
df[(df['toefl score'].isin(range(105, 115)))]

            gre score  toefl score
Serial No.
2                 324          107
4                 322          110